# PANDAS

# part 1

# Agenda:
    .What is pandas
    .Pandas va Excel
    .Pandas Data Structures
    .Pandas vs Numpy
    .Installation of pandas
    .how to use pandas library

# what is pandas :
    .pandas is a powerful python data analysis toolkit.
    .open source
    .A fast and efficient Dataframe object for data manipulations
    .Reading and writing data structers and differnt formats:csv,tsv,txt,Xml,Json,Zip etc...

# Pandas Data Structures:
    .Series: one dimentionaled labeled homogenious array
    .DataFrame: 2 dimentionaled labeled heterogenious,tabular , series + series = dataframe
    .Panel: 3 dimentionals labeled array

# Pandas vs numpy:
    .Numpy array is used for the implementation of pandas data object

# PART 2

# pandas series

In [1]:
import pandas as pd

In [4]:
pd.__version__  # used for checking which version of pandas you are working now

'1.0.3'

In [7]:
list_s = [1,2,-3,6.3,'data values']
print(list_s)

[1, 2, -3, 6.3, 'data values']

In [10]:
series1 = pd.Series(list_s)
print(series1)

0              1
1              2
2             -3
3            6.3
4    data values
dtype: object

In [12]:
type(series1) # one dimentional index array

pandas.core.series.Series

In [13]:
series2 = pd.Series([1,2,3,4,5])
print(series2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
empty_s = pd.Series([])
print(empty_s)

Series([], dtype: float64)

E:\anaconda\envs\TensorFlow\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [17]:
series3 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(series3)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [18]:
series4 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'],dtype = float)
print(series4)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64

In [19]:
series5 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'],dtype = float,name = 'data values')
print(series5)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: data values, dtype: float64

In [21]:
scaler_s = pd.Series(0.5,index = [1,2,3])
print(scaler_s)

1    0.5
2    0.5
3    0.5
dtype: float64

In [22]:
scaler_s = pd.Series(0.5)
print(scaler_s)

0    0.5
dtype: float64

In [24]:
dict_s = pd.Series({'a':1,'b':2,'c':3})
dict_s

a    1
b    2
c    3
dtype: int64

In [26]:
s4 = pd.Series([1,2,3,4])
print(s4)

0    1
1    2
2    3
3    4
dtype: int64

In [27]:
s4[0]

1

In [28]:
s4[3]

4

In [29]:
s4[0:3]

0    1
1    2
2    3
dtype: int64

In [30]:
max(s4)

4

In [31]:
min(s4)

1

In [32]:
s4[s4>3]

3    4
dtype: int64

In [33]:
s4

0    1
1    2
2    3
3    4
dtype: int64

In [34]:
s5 = pd.Series([1,2,3,4,5])
print(s5)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [35]:
s4 + s5

0    2.0
1    4.0
2    6.0
3    8.0
4    NaN
dtype: float64

# PART 3

# What is Pandas DataFrame:
    .pandas DataFrame is two-dimensional,size-mutable,potentially heterogeneous tabular data structor with labeled axes
    (rows and Columns)

# 1. creating empty data frame

In [36]:
import pandas as pd

In [37]:
emt_df = pd.DataFrame()

In [38]:
print(emt_df)

Empty DataFrame
Columns: []
Index: []

# 2.Creating dataFrame using list

In [39]:
list = ['a','b','c','d']
print(list)

['a', 'b', 'c', 'd']

In [41]:
df1 = pd.DataFrame(list)
print(df1)

   0
0  a
1  b
2  c
3  d

# 3.   creating dataframe using list of list

In [43]:
ls_of_ls = [[1,2,3],[3,4,5],[6,77,8],[4,5,6],[2,5,6]]
print(ls_of_ls)

[[1, 2, 3], [3, 4, 5], [6, 77, 8], [4, 5, 6], [2, 5, 6]]

In [44]:
df2 = pd.DataFrame(ls_of_ls)
df2

   0   1  2
0  1   2  3
1  3   4  5
2  6  77  8
3  4   5  6
4  2   5  6

In [49]:
df2[0:3]

   0   1  2
0  1   2  3
1  3   4  5
2  6  77  8

In [50]:
df2[:]

   0   1  2
0  1   2  3
1  3   4  5
2  6  77  8
3  4   5  6
4  2   5  6

In [54]:
df2[0:2]

   0  1  2
0  1  2  3
1  3  4  5

In [55]:
df2[2]

0    3
1    5
2    8
3    6
4    6
Name: 2, dtype: int64

# 4.Creating dataFrame from dict or dictionary or python dictionary

In [56]:
dict1 = {"name":['pankaj','akash','bishal','biraj','munna'],"ID":[101,102,103,104,105]}

In [57]:
dict1

{'name': ['pankaj', 'akash', 'bishal', 'biraj', 'munna'],
 'ID': [101, 102, 103, 104, 105]}

In [58]:
type(dict1)

dict

In [60]:
df3 = pd.DataFrame(dict1)
df3

     name   ID
0  pankaj  101
1   akash  102
2  bishal  103
3   biraj  104
4   munna  105

In [61]:
df3['name']

0    pankaj
1     akash
2    bishal
3     biraj
4     munna
Name: name, dtype: object

In [62]:
df3['ID']

0    101
1    102
2    103
3    104
4    105
Name: ID, dtype: int64

In [63]:
df3.iloc[:]

     name   ID
0  pankaj  101
1   akash  102
2  bishal  103
3   biraj  104
4   munna  105

In [73]:
df3.iloc[0:4,0:1] #slicing the dictionary

     name
0  pankaj
1   akash
2  bishal
3   biraj

# 5.Creating dataframe from list to dict

In [75]:
ls_dict = [{'a':1},{'b':2},{"c":3},{'d':4},{"e":5}]
ls_dict

[{'a': 1}, {'b': 2}, {'c': 3}, {'d': 4}, {'e': 5}]

In [76]:
type(ls_dict)

list

In [77]:
df4  = pd.DataFrame(ls_dict)
print(df4)

     a    b    c    d    e
0  1.0  NaN  NaN  NaN  NaN
1  NaN  2.0  NaN  NaN  NaN
2  NaN  NaN  3.0  NaN  NaN
3  NaN  NaN  NaN  4.0  NaN
4  NaN  NaN  NaN  NaN  5.0

In [78]:
ls2_dict = [{'a':1,'b':3,'c':4},{"p":1,'d':2,'e':3},{'m':2,'t':3,'r':5}]

In [79]:
type(ls2_dict)

list

In [81]:
df5 = pd.DataFrame(ls2_dict)
df5

     a    b    c    p    d    e    m    t    r
0  1.0  3.0  4.0  NaN  NaN  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  1.0  2.0  3.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN  NaN  NaN  2.0  3.0  5.0

In [84]:
ls3_dict = [{'a':1,'b':3,'c':4},{'a':1,'b':3,'c':4},{'a':1,'b':3,'c':4},{'a':1,'b':3,'c':4},{'a':1,'b':3,'c':4,'m':3}]

In [85]:
df6 = pd.DataFrame(ls3_dict)
print(df6)

   a  b  c    m
0  1  3  4  NaN
1  1  3  4  NaN
2  1  3  4  NaN
3  1  3  4  NaN
4  1  3  4  3.0

# 6. Creating dataframe from dict of series

In [86]:
dict_sr = {'ID':pd.Series([1,2,3]),'SN':pd.Series([111,222,333])}
df7 = pd.DataFrame(dict_sr)
df7

   ID   SN
0   1  111
1   2  222
2   3  333

# PART 4

# HOW TO READ CSV FILES USING PANDAS

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("student_results.csv")

# sgowing the first 5 records

In [4]:
df.head(5)  # default its gives us five records or five rows

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75

# if you need to show last 5 records then

In [7]:
df.tail(5)
# df.tail() # if you dont include the parameter 5 by default its return the last 5 records

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

# IF you want to see the first 10 rows of the data frame then,

In [8]:
df.head(10)

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

# if you want to see the only columns name then

In [9]:
df.columns

Index(['Student ID', 'Class', 'Study hrs', 'Sleeping hrs',
       'Social Media usage hrs', 'Mobile Games hrs', 'Percantege'],
      dtype='object')